import React from 'react';
import '../../../css/currencyintroduce.css'

export default class LskInfo extends React.Component {


    componentDidMount() {
        document.body.scrollTop = 0
    }

    render() {

        return (
            <div className="rts-info">
                <div className="text-center rts-info-title">
                    瑞资链/RTS
                </div>
                <div className="coin-info-bgc-Image" style={{marginTop: "40px"}}></div>
                <div className="rts-info-main">
                    <h5>瑞资链的价值</h5>
                    <p>瑞资链的价值主要体现在以下四个方面: </p>
                    <p>1.瑞资链的基石是所有瑞资链钱包的用户。瑞资链钱包与传统数字资产钱包不同，未来所有金融资产展示、重大事件公示、瑞资链(但不限于瑞资链)权力实施等都会直接在钱包上展示和完成，钱包是资产发行方和 投资者之间最直接的互动平台。所以瑞资链钱包的用户数量和质量是瑞 资链的重要价值体现。</p>
                    <p>2. 瑞资链的能量来自于发行的数字资产规模。瑞资链未来发行以实物资产 或金融资产为依托的数字资产，吸引更多数字资产投资者，链上所挂接 的金融资产的总值，是衡量瑞资链价值的一个重要指标。</p>
                    <p>3. 瑞资链的核心利益与数字资产交易所绑定在一起。我们为交易所提供有 价值的稳定的数字资产，为交易所引入更多的风险偏好比较低的用户群， 引入传统金融市场所有的优质投资人以及大体量的资金。</p>
                    <p>4. 瑞资链的生命取决于制度建立。完成各项制度的法律建设是贯穿在瑞资 链发展始终的，所有建设成果将全部公示于瑞资链上，以确保 ECC 拥有 绝对主权，实现 DAC 的梦想，为价值创造提供更稳健的发展环境。</p>
                    <h5>瑞资的定位 </h5>
                    <p>瑞资团队，不是数字资产供应商，是为实体行业以及金融企业提供区块链技 术服务，帮助其跨越区块链技术鸿沟，使用其熟悉的方式生产数字资产;并将其 数字资产快速在全球数字资产交易所发行，扩大交投规模，实现价值创造。</p>
                    <p>瑞资链，不是数字资产交易所，是通过为数字资产交易所入风险系数较小的、 以实物资产或金融资产为依托的、优质的数字资产，从而扩大数字资产投资者和 投资者资金的规模，实现价值创造。  瑞资链钱包，不再仅仅是简单的资产流转工具，而是资产运营者和投资者的 互动窗口。所有新资产发行的公告，资产分红信息披露，重要问题公告，股权型 资产的投票以及结果公示，都将展示在钱包之上。</p>
                    <h5>关于瑞资团队</h5>
                    <p>瑞资团队由区块链行业专家和金融行业精英共同创立，现共有 10 余人，团 队成员均来自区块链行业或金融行业，团队主要成员如下:</p>
                    <p>严志，创始人，瑞资链架构设计及团队负责人，超过 10 年金融 IT 产业从业背景，3 年数字货币及区块链技 术产品管理经验，长期运营互联网金融产品，连续创业者。</p>
                    <p>朱耀宗，创始人，瑞资链技术开发负责人，15 年以上 IT 行业工作经验，曾在 TI、摩托罗拉等高科技公司担 任技术负责人，数十项软件产品量产经验,精通软件系 统原理与架构。</p>
                    <p>刘坚，创始人，瑞资链金融顾问、法律和制度建设负责 人，美国注册会计师(CPA)，10 年以上全球房地产金 融领域经验，曾任瑞银集团全球不动产业务大中华区 首席运营官(COO),运作管理的境内、境外投资基金规 模超过 20 亿美元。</p>
                    <p>林小晓，瑞资链金融业务负责人，曾任安邦集团总裁 助理(投资)与战略投资部投资经理，参与多个大型跨境并购项目，如招商银行、世纪证券、日本 ING 寿险 等。</p>
                    <h5>未来的盈利模式</h5>
                    <p>我们预见瑞资链可产生的盈利点包括但不限于如下类目:</p>
                    <p>1.数字资产发行基础服务费，由两部分组成:一是根据拟发行的数字资产 规模收取 1%~1.5%的服务费;二是根据资产投资人的总覆盖量，收取资产发行方 1%的通道费。</p>
                    <p>2.数字资产发行衍生服务费，是未来伴随数字资产发行而可能产生的增值 收费项目 </p>
                    <p>3.为数字资产交易所提供投资者投资行为偏好大数据分析服务费</p>
                    <p>4.为精英投资者提供 VIP 投资咨询差异化服务的费用</p>
                    <h5>瑞资的实施路线图</h5>
                    <p>瑞资的实施路线图分三个阶段，分别为: </p>
                    <p>1.第一阶段，技术改造</p>
                    <p>全力打造瑞资链，使得区块链技术能为现实世界的真实资产服务。</p>
                    <p>2.第二阶段，试点运营</p>
                    <p>与优秀金融机构试点合作，把优质金融资产通过瑞资链进行资产数字化，并 在数字资产交易所上市，意在探索一条真实金融资产进入数字资产市场的合法合 规路径，为日后大体量数字资产通向全球数字资产市场打下基础。</p>
                    <p>3.第三阶段，全面推广</p>
                    <p>为拥有实物资产或金融资产的机构发行数字资产，并通过瑞资链进入全球数 字资产交易所大门，走向世界。</p>
                </div>
                <div className="coin-info-bgc-Image" style={{marginBottom: "50px"}}></div>
            </div>

        )
    }
}