import React from 'react';
import '../../../css/currencyintroduce.css'

export default class TlcInfo extends React.Component {


    componentDidMount() {
        document.body.scrollTop = 0
    }

    render() {

        return (
            <div className="tlc-info">
                <div className="text-center tlc-info-title">
                    藏宝大陆/TLC
                </div>
                <div className="coin-info-bgc-Image" style={{marginTop: "40px"}}></div>
                <div className="tlc-info-main">
                    <h5>TL游戏介绍</h5>
                    <p>
                        TL游戏是一款虚拟游戏，玩家的主要任务为探索、旅行，以及开采含有TLC的矿石，通过在现实世界中移动手机完成在虚拟游戏中的旅行。该游戏将手机的GPS定位转换为游戏中的位置，游戏角色将随着手机的移动而变换位置。值得注意的是，游戏中的所有道路都是基于现实世界的道路而设计的。
                    </p>
                    <p>
                        游戏玩家的使命就是去寻找、开采及加工那些分散在世界各地的矿石，从而得到TLC。这些币“隐藏”在游戏中的地图中，但必须要通过挖矿和加工才能使其成为具有实际意义的TLC。
                    </p>
                    <h5>游戏机制</h5>
                    <p>
                        在游戏地图上移动依赖于现实世界中的运动，这与PokemonGO游戏中币的获取途径类似。为了采矿，玩家首先要接近并点击矿石，这时就会启动采矿迷你游戏。采矿迷你游戏是一个有趣的互动过程，玩家必须点击屏幕将箭头射向绿色区域，箭头越多，矿石开采的速度就越快，也就是说矿石开采的速度取决于玩家的游戏水平。
                    </p>
                    <h5>未来计划及更新周期</h5>
                    <p>
                        也许你会觉得这款游戏非常简单，但这仅仅是它的初级版本。当我们最初设计这款游戏时，我们的方向是构建一个充满无限量数字货币的虚拟世界，然而，这将需要更多时间和无数次的升级去实现，为此，我们已经做好了计划。
                    </p>
                    <p>
                        TL游戏的研发团队将竭尽全力去完成TL的目标，我们将按月发布新功能，并提前将功能上线的时间表公布在TL网站上，游戏功能和设计上的更新及操作说明书将会每月发布一次。
                    </p>
                    <h5>游戏上线后的前几个月将会进行以下升级：</h5>
                    <p><span className="font-weight" style={{color:"#000"}}>挖矿迷你游戏：</span>玩家可以随时激活能量钻，这个能量钻拥有30分钟的燃油定时器，它需要玩家摇动手机去激活，然后开采矿石。这种采矿方式需要玩家参与一些活动，如果无暇参与，那就不能完成冒险任务。</p>
                    <p><span className="font-weight" style={{color:"#000"}}>技能系统：</span>该游戏将引入“技能树”，帮助玩家培养采矿技能，从而有助于他们在游戏中的表现。</p>
                    <p><span className="font-weight" style={{color:"#000"}}>安装：</span>玩家将会收到一个可移动的云端负载工具，以便于他们可以利用一根操作杆来探索宝藏，而不需要使用GPS四处旅行。</p>
                    <h5>TLC代币技术说明</h5>
                    <p>TL币使用多链技术，这种技术为创造私有链提供平台。虽然它存在的目的是为区块链提供平台，但多链为比特币生态系统提供最大兼容，包括对等协议，交易/格式和比特币的核心API /运行时参数。</p>
                    <p>由于我们的区块链与具体的游戏币绑定，所以开采方式与标准的币有些不同。</p>
                    <p>我们必须区分币的开采与分配。币的验证是在我们的系统中私下完成的，这意味着我们需要用专业的机器控制挖矿，这样做是为了防止第三方篡改系统，因为它很容易受到攻击，而用我们的系统就不可能出现这种情况。此外，在我们区块链中每一个区块形成的时间仅为2秒钟。</p>
                    <p>TL所有的币都预先开采到系统钱包中，再由系统将其分发给用户，币的分配是通过采矿游戏完成的。</p>
                    <p>当玩家玩TL游戏时，通过游戏任务赚取金币，这些币再从预先设定好的钱包中转移到个人钱包里，系统中的每个玩家都会自动收到钱包地址，但他们也可自行下载本地钱包将币取走，而再此过程中，用户可以通过搜索我们的区块链浏览器查到所需信息。</p>
                    <p>TL的代码在GitHub上是公开的，每个参与者都可以检查。所以，在任何情况下，我们都不可能产生额外的币。</p>
                    <p>如果我们想对区块链做出的任何修改，首先必须由系统管理员委员会批准。我们是原始管理员，也可以设置其他管理员。如果在委员会有100个席位，想要改动区块链则至少需要争得51位管理员的同意。</p>
                    <p>我们的区块链系统完全公开、透明的，不可能隐藏任何东西。</p>
                    <p>在TL生态圈中，TLC的用途非常广泛，它可以用于购买TL游戏道具和游戏升级，也可以用于我们开发的其他游戏中。未来我们将发布更多对客户有益的游戏功能，以保持TLC的流通。每次TL APP版本的升级都将会增加一些TLC的新用途，请拭目以待。 </p>
                    <h5>ICO 数据说明</h5>
                    <p>ICO众筹的所有资金将用于项目的进一步建设，但出于综合考虑，我们将分散一些TLC：</p>
                    <p>2亿TLC将在ICO期间出售</p>
                    <p>2.5亿TLC将提供给Phuketcoin用户社区以供兑换</p>
                    <p>5000万TLC将被保留，用于游戏赏金或其他奖励的发放</p>
                    <p>5亿TLC将被“隐藏”在游戏中，等待玩家开采</p>
                </div>
                <div className="coin-info-bgc-Image" style={{marginBottom: "50px"}}></div>
            </div>

        )
    }
}